from matplotlib.pylab import date2num
import pymysql
import pandas as pd
from tqdm import tqdm
from decimal import Decimal
import numpy as np

# wdyx.info()
# print(wdyx.head())

def date_to_num(dates):
    num_time = []
    for date in dates:
        num_date = date2num(date)
        num_time.append(num_date)
    return num_time


db = pymysql.connect(host='rm-7xv6n273986pzur7e5o.mysql.rds.aliyuncs.com', user='data_process',
                     password='Dp@20220906!!', port=3306, db='zy_fund_flow', charset='utf8')
cursor = db.cursor()
date_list = ['2024-02-08', '2024-02-19', '2024-03-20']
sql = "select department from department_url;"
cursor.execute(sql)
result = cursor.fetchall()
department_list = []
for item in result:
    department_list.append(item[0])

result = {}
for department in tqdm(department_list):
    rows = []
    for date in tqdm(date_list):
        sql = ("select sum(daily_holding_amount) from department_stock_info where belong_part = '家电行业' "
               "and unixTime = unix_timestamp(%s) and department_name = %s;")
        cursor.execute(sql, (date, department))
        temp = cursor.fetchone()[0]
        if temp is None:
            rows.append(0)
        else:
            rows.append(temp)
    result[department] = rows
# result = pd.DataFrame(result)
# result = {'ABN AMRO Clearing Hong Kong Limited': [Decimal('8566250000'), Decimal('15845140000'), Decimal('22981050000')], '安信国际证券(香港)有限公司': [Decimal('71487970000'), Decimal('71487970000'), Decimal('71487970000')], '贝塔国际证券有限公司': [0, 0, 0], '宝新证券有限公司': [Decimal('104360000000'), Decimal('104360000000'), Decimal('104360000000')], 'BTIG Hong Kong Limited': [0, 0, 0], '宝生证券有限公司': [Decimal('51465160000'), Decimal('54802360000'), Decimal('51299160000')], '创兴证券有限公司': [Decimal('20000000'), Decimal('20000000'), Decimal('20000000')], '长雄证券有限公司': [0, 0, 0], '长江证券经纪(香港)有限公司': [Decimal('400000000'), Decimal('400000000'), Decimal('400000000')], '财通国际证券有限公司': [Decimal('1340000000'), Decimal('1340000000'), Decimal('1340000000')], '长桥证券(香港)有限公司': [0, 0, 0], '创兴银行有限公司': [0, 0, 0], '东亚证券有限公司': [Decimal('150500000'), Decimal('150500000'), Decimal('205500000')], '大华继显(香港)有限公司': [Decimal('3099000000'), Decimal('3099000000'), Decimal('3099000000')], '大辉证券有限公司': [0, 0, 0], '大丰昆泰证券有限公司': [Decimal('600000000'), Decimal('600000000'), Decimal('600000000')], '东信证券有限公司': [0, 0, 0], '第一上海证券有限公司': [0, 0, 0], '大新证券有限公司': [Decimal('30000000'), Decimal('30000000'), Decimal('30000000')], '大和资本市场香港有限公司': [0, 0, 0], '东方证券(香港)有限公司': [Decimal('2560000000'), Decimal('2560000000'), Decimal('2560000000')], '东吴证券国际经纪有限公司': [Decimal('130000000'), Decimal('130000000'), Decimal('130000000')], '东兴证券(香港)有限公司': [0, 0, 0], '德意志银行股份有限公司': [Decimal('281941540000'), Decimal('281941540000'), Decimal('281941540000')], '复星国际证券有限公司': [0, 0, 0], '富昌证券有限公司': [0, 0, 0], '富册国际证券期货有限公司': [0, 0, 0], '富瑞金融集团香港有限公司': [0, 0, 0], '富邦证券(香港)有限公司': [Decimal('46000000'), Decimal('46000000'), Decimal('46000000')], '富途证券国际(香港)有限公司': [Decimal('34031180000'), Decimal('49658180000'), Decimal('49468180000')], '方正证券(香港)有限公司': [0, 0, 0], '方德证券有限公司': [Decimal('185000000'), Decimal('185000000'), Decimal('185000000')], '法国巴黎银行': [Decimal('988628710000'), Decimal('739013300000'), Decimal('929797980000')], '法国兴业银行': [Decimal('43778580000'), Decimal('22877960000'), Decimal('20997960000')], '光大证券投资服务(香港)有限公司': [Decimal('3770000000'), Decimal('1770000000'), Decimal('1770000000')], '国金证券(香港)有限公司': [Decimal('1600000000'), Decimal('1600000000'), Decimal('1600000000')], '高盛(亚洲)证券有限公司': [Decimal('1399908570000'), Decimal('470814160000'), Decimal('1300499030000')], '国泰君安证券(香港)有限公司': [Decimal('33513000000'), Decimal('33513000000'), Decimal('29164000000')], '工银亚洲证券有限公司': [Decimal('2370000000'), Decimal('2370000000'), Decimal('2370000000')], '国元证券经纪(香港)有限公司': [0, 0, 0], '广发证券(香港)经纪有限公司': [Decimal('6054000000'), Decimal('5854000000'), Decimal('5986000000')], '国泰证券(香港)有限公司': [Decimal('300000000'), Decimal('300000000'), Decimal('300000000')], '工银国际证券有限公司': [Decimal('805000000'), Decimal('805000000'), Decimal('805000000')], '国都证券(香港)有限公司': [Decimal('402800000'), Decimal('402800000'), Decimal('402800000')], '国信证券(香港)经纪有限公司': [Decimal('1286000000'), Decimal('1286000000'), Decimal('1286000000')], '汇丰金融证券(香港)有限公司': [Decimal('3500000000'), Decimal('3500000000'), Decimal('3500000000')], '宏高证券有限公司': [0, 0, 0], '海通国际证券有限公司': [Decimal('2586000000'), Decimal('2586000000'), Decimal('2586000000')], '华富建业证券有限公司': [0, 0, 0], '华侨证券经纪(香港)有限公司': [Decimal('6000000'), Decimal('6000000'), Decimal('6000000')], '恒生证券有限公司': [Decimal('5941000000'), Decimal('10091000000'), Decimal('5941000000')], '辉立证券(香港)有限公司': [Decimal('11942600000'), Decimal('11942600000'), Decimal('11942600000')], '恒丰证券有限公司': [0, 0, 0], '海富证券有限公司': [0, 0, 0], '华兴金融服务(香港)有限公司': [0, 0, 0], '华诚证券有限公司': [0, 0, 0], '亨达证券有限公司': [0, 0, 0], '汇信理财有限公司': [0, 0, 0], '汇泽证券有限公司': [Decimal('113000000'), Decimal('113000000'), Decimal('113000000')], '华泰金融控股(香港)有限公司': [Decimal('32934310000'), Decimal('28934310000'), Decimal('29944310000')], '哈富证券有限公司': [Decimal('2854000000'), Decimal('2854000000'), Decimal('2854000000')], '华盛资本证券有限公司': [Decimal('5330000000'), Decimal('4897000000'), Decimal('4817000000')], '核聚证券有限公司': [0, 0, 0], '横华国际证券有限公司': [Decimal('668000000'), Decimal('668000000'), Decimal('668000000')], '华升证券(国际)有限公司': [0, 0, 0], '混沌天成国际证券期货有限公司': [0, 0, 0], '弘量研究有限公司': [0, 0, 0], '韩国投资证券亚洲有限公司': [0, 0, 0], '华福国际证券有限公司': [0, 0, 0], '华安证券(香港)经纪有限公司': [0, 0, 0], '结好证券有限公司': [0, 0, 0], '京华山一国际(香港)有限公司': [0, 0, 0], '金利丰证券有限公司': [0, 0, 0], '嘉信证券有限公司': [0, 0, 0], '钜亨证券有限公司': [0, 0, 0], '建银国际证券有限公司': [0, 0, 0], '极讯亚太有限公司': [Decimal('84000000'), Decimal('20000000'), 0], '交银国际证券有限公司': [Decimal('488000000'), Decimal('488000000'), Decimal('488000000')], '金马证券有限公司': [0, 0, 0], '嘉谟证券有限公司': [0, 0, 0], 'JPMorgan Chase Bank, National Association': [Decimal('2736400360000'), Decimal('2738511360000'), Decimal('2741438360000')], '凯基证券亚洲有限公司': [Decimal('1037670000'), Decimal('1037670000'), Decimal('1237670000')], '六福证券(香港)有限公司': [0, 0, 0], '立桥证券有限公司': [Decimal('79500000'), Decimal('79500000'), Decimal('47500000')], '利弗莫尔证券有限公司': [Decimal('19510000'), Decimal('19510000'), Decimal('19510000')], '立桥国际证券有限公司': [0, 0, 0], '老虎证券(香港)环球有限公司': [0, 0, 0], '摩根大通金融(香港)有限公司': [Decimal('867113460000'), Decimal('898221930000'), Decimal('843972190000')], '茂宸证券有限公司': [0, 0, 0], '美林远东有限公司': [Decimal('1162579490000'), Decimal('1423709010000'), Decimal('1269757260000')], '马银证券(香港)有限公司': [Decimal('865000000'), Decimal('865000000'), Decimal('865000000')], '摩根士丹利香港证券有限公司': [Decimal('1506636570000'), Decimal('1521707480000'), Decimal('1330536030000')], '民银证券有限公司': [0, 0, 0], '摩石证券有限公司': [0, 0, 0], '美国花旗银行': [Decimal('1836929060000'), Decimal('1761281510000'), Decimal('1722330590000')], '南华证券投资有限公司': [0, 0, 0], '农银国际证券有限公司': [Decimal('136000000'), Decimal('136000000'), Decimal('136000000')], '浦银国际证券有限公司': [0, 0, 0], '群益证券(香港)有限公司': [0, 0, 0], '瑞银证券(香港)有限公司': [Decimal('1373521310000'), Decimal('1499157940000'), Decimal('1369555110000')], '软库中华金融服务有限公司': [0, 0, 0], '瑞士信贷证券(香港)有限公司': [0, 0, 0], '瑞丰证券有限公司': [0, 0, 0], '申万宏源证券(香港)有限公司': [Decimal('24058350000'), Decimal('24058350000'), Decimal('24058350000')], '时富证券有限公司': [0, 0, 0], '胜利证券有限公司': [0, 0, 0], '上银证券有限公司': [Decimal('8352000000'), Decimal('8352000000'), Decimal('8109000000')], '山证国际证券有限公司': [0, 0, 0], '山金证券(香港)有限公司': [0, 0, 0], '太平证券(香港)有限公司': [0, 0, 0], '天风国际证券与期货有限公司': [Decimal('1300000000'), 0, 0], '台新国际商业银行股份有限公司': [0, 0, 0], '未来资产证券(香港)有限公司': [0, 0, 0], '伟禄亚太证券有限公司': [0, 0, 0], '微牛证券有限公司': [Decimal('108000000'), Decimal('108000000'), Decimal('270000000')], '香港中央结算有限公司': [Decimal('160000'), Decimal('160000'), Decimal('160000')], '信诚证券有限公司': [0, 0, 0], '信达国际证券有限公司': [0, 0, 0], '星展唯高达香港有限公司': [Decimal('2578000000'), Decimal('2578000000'), Decimal('2578000000')], '兴证国际证券有限公司': [0, 0, 0], '信银(香港)资本有限公司': [0, 0, 0], '新永安国际证券有限公司': [0, 0, 0], '新加坡星展银行有限公司': [Decimal('3584860000'), Decimal('3584860000'), Decimal('3584860000')], '香港上海汇丰银行有限公司': [Decimal('14575203240000'), Decimal('3475542600000'), Decimal('14992992110000')], '兴业银行股份有限公司': [0, 0, 0], '英皇证券(香港)有限公司': [0, 0, 0], '奕丰证券(香港)有限公司': [Decimal('237200000'), Decimal('237200000'), Decimal('237200000')], '永丰金证券(亚洲)有限公司': [Decimal('11006000000'), Decimal('11006000000'), Decimal('11006000000')], '越秀证券有限公司': [0, 0, 0], '盈透证券香港有限公司': [Decimal('48011650000'), Decimal('48148650000'), Decimal('48287650000')], '耀才证券国际(香港)有限公司': [Decimal('9299000000'), Decimal('8212000000'), Decimal('10462000000')], '元富证券(香港)有限公司': [0, 0, 0], '元大证券(香港)有限公司': [Decimal('6260000000'), Decimal('6260000000'), Decimal('6260000000')], '元宇证券有限公司': [0, 0, 0], '云锋证券有限公司': [Decimal('200000000'), Decimal('200000000'), Decimal('200000000')], '雅利多证券有限公司': [0, 0, 0], '中银国际证券有限公司(香港)': [Decimal('1221058560000'), Decimal('1261610240000'), Decimal('1221058560000')], '中信里昂证券有限公司': [Decimal('125593030000'), Decimal('116481720000'), Decimal('121461030000')], '招商证券(香港)有限公司': [Decimal('1111670000'), Decimal('730670000'), Decimal('730670000')], '中信证券经纪(香港)有限公司': [Decimal('1384200000'), Decimal('1227200000'), Decimal('1227200000')], '中国银河证券香港有限公司': [Decimal('1324000000'), Decimal('1324000000'), Decimal('1324000000')], '兆安证券有限公司': [0, 0, 0], '致富证券有限公司': [Decimal('312000000'), Decimal('310000000'), Decimal('295000000')], '中国国际金融香港证券有限公司': [Decimal('221185340000'), Decimal('232256830000'), Decimal('261004830000')], '招银国际证券有限公司': [Decimal('1499170000'), Decimal('1499170000'), Decimal('1940170000')], '中国银河国际证券(香港)有限公司': [Decimal('200000000'), Decimal('200000000'), Decimal('200000000')], '中泰国际证券有限公司': [Decimal('185000000'), Decimal('185000000'), Decimal('185000000')], '中信建投(国际)证券有限公司': [0, 0, 0], '中薇证券有限公司': [0, 0, 0], '中富证券有限公司': [0, 0, 0], '直达国际金融服务有限公司': [0, 0, 0], '尊嘉证券国际有限公司': [Decimal('315460000'), Decimal('315460000'), Decimal('315460000')], '浙商国际金融控股有限公司': [0, 0, 0], '中国银行(香港)有限公司': [Decimal('209160620000'), Decimal('221930620000'), Decimal('221930620000')], '中国建设银行(亚洲)股份有限公司': [Decimal('4023000000'), Decimal('4018000000'), Decimal('4018000000')], '渣打银行(香港)有限公司': [Decimal('10556265390000'), Decimal('10581380390000'), Decimal('10589831960000')], '中国工商银行(亚洲)有限公司': [0, 0, 0], '招商永隆银行有限公司': [Decimal('1983000000'), Decimal('1983000000'), Decimal('2023000000')], '中信银行(国际)有限公司': [Decimal('241000000'), Decimal('241000000'), Decimal('241000000')], '招商银行股份有限公司': [Decimal('250000000'), Decimal('250000000'), Decimal('250000000')], '中国民生银行股份有限公司': [0, 0, 0], 'CHINA SECURITIES DEPOSITORY AND CLEARING': [0, 0, 0], '中国证券登记结算有限责任公司': [0, 0, 0]}
result = pd.DataFrame(result, index=date_list).transpose()
print(sum(list(result.loc[:, date_list[2]].values)))
s = 0
for i in result.loc[:, date_list[2]].values:
    print(i/10000)
    s += int(i)
print(s)

temp = np.array(result.loc[:, '2024-02-08']) - np.array(result.loc[:, '2024-02-19'])
result = pd.DataFrame(temp, index=result.index)
# result.sort_values()

cursor.close()
db.close()